<?php
	$books= array("Рей Брэдбери" => ["451° по Фаренгейту", "Вино из одуванчиков"],
		"Грегори Дэвид Робертс" => ["Шантарам", "Тень горы"],
		"Джордж Оруэлл" => "1984", 
		"Михаил Афанасьевич Булгаков" => "Мастер и Маргарита", 
		"Эрих Мария Ремарк" => "Три товарища",
		"Оскар Уайльд" => "Портрет Дориана Грея", 
		"Даниел Киз"=> "Цветы для Элджернона",
		"Джером Д. Сэлинджер" => "Над пропастью во ржи", 
		"Антуан де Сент-Экзюпери" => "Маленький принц", 
		"Лев Толстой" => "Анна Каренина", 
		"Габриэль Гарсиа Маркес" => "Сто лет одиночества",
		"Айн Рэнд" => "Атлант расправил плечи");
	
	echo "<ol>";
	foreach ( $books as $key => $value ) {
		if (is_array($value)) {
			echo "<li>$key: ";
				foreach ( $value as $book ) { 
					echo "<br> - $book ";
				}
			echo "</li>";
		} else {
			echo "<li> $key - $value </li>";
		}
	}
	echo "</ol>";
?>